Repository: common-repository/wsb-etomitreba
Catalog: languages/wsb-rba-*.po
Languages: hr

source: Setup
hr: Postavke

source: RBA payment gateway for Visa and Mastercard cards.
hr: RBA payment gateway za Visa i Mastercard kartice.

source: Plugin e-ToMiTreba can work properly only with HRK as default currency!
hr: Dodatak e-ToMiTreba radit će ispravno samo ako je zadana valuta trgovine HRK!

source: Order
hr: Narudžba

source: Pay order
hr: Plati narudžbu

source: Enable/Disable
hr: Uključeno/Isključeno

source: Enabled
hr: Uključeno

source: Title
hr: Naziv

source: This controls the title which the user sees during checkout.
hr: Ovime se kontrolira naziv koji korisnik vidi u procesu kupovine.

# Credit Card payment
source: Visa / Mastercard card
hr: Visa / Mastercard kartica

source: Description
hr: Opis

source: Payment method description that the customer will see on your checkout.
hr: Opis metode plaćanja koji će kupac vidjeti u procesu naplate.

source: Credit Card payment via secure gateway of RBA bank.
hr: Plaćanje karticama na sigurnom sučelju RBA banke.

source: Merchant identification number you received from the bank (MerchantID).
hr: Jedinstvena oznaka trgovca koju ste dobili od banke (MerchantID).

source: Terminal code you received from the bank (TerminalID).
hr: Oznaka terminala koju ste dobili od banke (TerminalID).

source: Testing
hr: Testiranje

source: Check if you want to work in test mode.
hr: Označite ako želite koristiti testno sučelje.

source: Authorization
hr: Autorizacija

source: In authorization mode you need to approve transaction manually. Useful when you need to check your stock before final payment. You need to request enabling a "Delay" parameter from bank if you want to use this feature.
hr: U autorizacijskom načinu rada svaku autoriziranu transakciju morate ručno odobriti kroz sučelje trgovca na stranicama RBA. Ako želite koristiti ovu opciju, prvo zatražite od banke da vam aktiviraju autorizaciju na terminalu.

source: Show logo
hr: Prikaži logo

source: If enabled, eToMiTreba logo will be shown on payment method list in frontend.
hr: Ako je uključeno, logo e-ToMiTreba bit će prikazan uz ovaj način plaćanja.

source: Custom redirect pages
hr: Stranice za preusmjeravanje

source: If enabled, customer will be redirected to the custom pages after transaction. These pages need to be defined in merchant interface (Success URL and Failure URL)
hr: Ako je uključeno, kupac će nakon transakcije biti preusmjeren na stranice zadane u poljima Success URL i Failure URL u sučelju trgovca na stranici banke. Ako je isključeno, koristit će se zadane vrijednosti iz Woocommerce-a.

source: Status for successful transaction
hr: Status za uspješnu transakciju

source: Order status for successful transaction.
hr: Status nakon uspješne transakcije

source: Digital signature error. Transaction number: %d
hr: Greška u potpisu! Broj transakcije: %d

source: Payment completed. Approval code: %d
hr: Plaćanje je završeno. Broj odobrenja: %d

source: Forbidden transaction! Code: %d
hr: Transakcija nije odobrena! Oznaka: %d

source: Extends WooCommerce with an eToMiTreba gateway.
hr: Proširuje WooCommerce metodom plaćanja eToMiTreba.
